In [4]:
import pandas as pd

In [3]:
df = pd.read_csv('gapminder.tsv',sep='\t')

### 데이터 추출
#### (1) 열 추출 (column 추출, 세로 추출)

In [9]:
df['country']

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

* df==> 변수이름으로 인식 'df'==> 단순 문자로 취급, 인식

##### 앞에 다섯개의 자료만 열 추출하기 !!!

In [13]:
df['country'].head()

0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
Name: country, dtype: object

In [20]:
df[['country', 'year', 'pop']]

          country  year       pop
0     Afghanistan  1952   8425333
1     Afghanistan  1957   9240934
2     Afghanistan  1962  10267083
3     Afghanistan  1967  11537966
4     Afghanistan  1972  13079460
...           ...   ...       ...
1699     Zimbabwe  1987   9216418
1700     Zimbabwe  1992  10704340
1701     Zimbabwe  1997  11404948
1702     Zimbabwe  2002  11926563
1703     Zimbabwe  2007  12311143

[1704 rows x 3 columns]

#### 열 추출할 때 한개가 아닌 여러개의 columns를 추출하고 싶다면 
#### 단순한 나열이 아닌 리스트(대괄호)를 [[두번]] 감싸주는 방식으로 사용해야함

### 여러 열의 추출 또한 다섯개까지 출력하는 head() 사용가능!!

In [28]:
df[['country', 'year', 'pop']].head()

       country  year       pop
0  Afghanistan  1952   8425333
1  Afghanistan  1957   9240934
2  Afghanistan  1962  10267083
3  Afghanistan  1967  11537966
4  Afghanistan  1972  13079460

* 한줄 출력은 Series 유형, 여러 줄은 DataFrame 유형

In [25]:
type(df['country'])

pandas.core.series.Series

In [27]:
type(df[['country', 'year', 'pop']])

pandas.core.frame.DataFrame

* 1번) country만 따로 떼서 출력 == df['country']
* 2번) country만 따로 뗀 것을 다섯개만 보여주기 == df['country'].head()
* 3번) country만 따로 뗀 것의 유형은? == type(df['country'])
## ** Series는 df.dtypes와 df.info() 함수가 먹히지 않음!!

** 43m48s

* country, continent, year 를 subset에 지정하려면?

In [35]:
subset = df[['country', 'continent', 'year']]

* subset 다 보여주지 말고 앞의 5줄만 보려면?

In [34]:
subset.head()

       country continent  year
0  Afghanistan      Asia  1952
1  Afghanistan      Asia  1957
2  Afghanistan      Asia  1962
3  Afghanistan      Asia  1967
4  Afghanistan      Asia  1972

### 데이터 추출
#### (2) 행 단위 데이터 추출 (row 추출, 가로 추출)

* df.loc[] (인덱스 기준) 과 df.iloc(순번기준) 을 활용한다!!!!

In [40]:
df.loc[0]

country      Afghanistan
continent           Asia
year                1952
lifeExp           28.801
pop              8425333
gdpPercap        779.445
Name: 0, dtype: object

In [41]:
df.iloc[0]

country      Afghanistan
continent           Asia
year                1952
lifeExp           28.801
pop              8425333
gdpPercap        779.445
Name: 0, dtype: object

In [43]:
df.iloc[1700:,3:]

      lifeExp       pop   gdpPercap
1700   60.377  10704340  693.420786
1701   46.809  11404948  792.449960
1702   39.989  11926563  672.038623
1703   43.487  12311143  469.709298